# Author : QYD720 
# Time : 2019/4/17


# 4.5 元组
# 需求：定义一个元组，并尝试修改，赋值，遍历元组
# 方法：（） 定义元组

ex1 = ["ZJG", "HJC", "YQ", "XX"]
ex2 = ("Q1", "Q2", "Q3")
# 定义列表和元组

print("列表示范:", ex1, "元组示范:", ex2, sep='\n',)  # print函数可以“，”隔开打印多种形式的东西，列表，字符串
# 打印定义

ex1[0] = "DZJG"
# ex2[0] = "QYD1"
# 修改列表元素 元组元素 将会报错

print("列表示范:", ex1, "元组示范:", ex2, sep='\n',)

ex1 = ["ZJG", "HJC", "YQ", "XX", "ZJ"]
ex2 = ("Q1", "Q2", "Q3", "Q4")
# 元组和列表 重新定义赋值

print("列表示范:", ex1, "元组示范:", ex2, sep='\n',)

for e1 in ex1:
    print(e1, end=' ')

for e2 in ex2:
    print(e2, sep=" ")  # print打印换行与否亦可以用 end=来定义，打印完了干啥？ sep=是指 打印的每个元素之间插入什么，多个同级别打印时候


